app/controllers/tasks_controller.rb

  def create
    #render :text => params.inspect
    @url_hash={controller: "tasks", action: "create"}

    @current_task = Task.create params.require("task").permit("name", "description")
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "i18n-bg"], ["description", "Translate the website in bulgarian"], ["created_at", "2015-02-19 09:10:31.972586"], ["updated_at", "2015-02-19 09:10:31.972586"]]

  def edit
    @current_task = Task.find_by id: params["id"]
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @current_task = Task.find_by id: params["id"]
    @current_task.update params.require("task").permit("name", "description")
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "test if the single form is working for tasks#edit as well"], ["updated_at", "2015-02-19 15:25:32.760250"], ["id", 4]]

  def show
    #render :text => params["id"].inspect
    @current_task = Task.find_by id: params["id"]
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]